# TaggedLocalRoomId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoomTag..::..TaggedLocalRoomId Property
RoomTag Class See Also
---
The ElementId of the tagged room.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ElementId TaggedLocalRoomId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TaggedLocalRoomId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TaggedLocalRoomId {
	ElementId^ get ();
}
```

# Remarks
If there is no tagged room so the RoomTag is orphaned, ElementId will be InvalidElementId.
# See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace